---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkEnergyEquationNotConverge
source: html/769461ca-bae3-4cce-67bb-eb4406ce9260.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkEnergyEquationNotConverge Property

The energy calculation could not be performed.

## Syntax (C#)
```csharp
public static FailureDefinitionId NetworkEnergyEquationNotConverge { get; }
```